app/controllers/houses_controller.rb

  def create
    @house = House.new(house_params)
    if @house.save
---
INSERT INTO "houses" ("name", "author", "source", "motto", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "fdsa"], ["author", "fds"], ["source", "sdf"], ["motto", "df"], ["created_at", "2018-04-19 19:16:31.914742"], ["updated_at", "2018-04-19 19:16:31.914742"]]