app/controllers/members_controller.rb

INSERT INTO "members" ("first_name", "last_name", "house_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["first_name", "Harry putter"], ["last_name", "putter"], ["house_id", 5], ["created_at", "2018-04-19 21:24:32.394013"], ["updated_at", "2018-04-19 21:24:32.394013"]]
---
  def create
    @member = Member.new(member_params)
    @house = House.find(params[:house_id])
    @member.house = @house

    if @member.save